[
    {
        "title": "Understanding the New Corporate Transparency Act",
        "date": "2023-11-15",
        "content": "The Corporate Transparency Act (CTA), effective January 1, 2024, introduces significant reporting requirements for most U.S. business entities. These new rules mandate that corporations, LLCs, and similar entities disclose their beneficial ownership information to FinCEN. \n\nKey points:\n- Applies to entities with fewer than 20 employees and $5M in revenue\n- Requires disclosure of individuals with 25%+ ownership or substantial control\n- Initial filings due within 30 days of entity formation in 2024\n- Existing entities must file by January 1, 2025\n\nPenalties for non-compliance include civil fines up to $500/day and criminal penalties up to 2 years imprisonment. Our corporate team can help ensure your business meets these new requirements."
    },
    {
        "title": "Navigating Divorce Mediation: What to Expect",
        "date": "2023-10-28",
        "content": "Mediation has become an increasingly popular alternative to traditional divorce litigation. This process involves a neutral third-party mediator who helps couples reach mutually agreeable solutions. \n\nBenefits of mediation:\n- Typically faster and less expensive than court battles\n- Allows for more creative, customized solutions\n- Reduces conflict, which is especially important when children are involved\n- Maintains privacy (unlike public court records)\n\nWhat to expect:\n1. Initial consultation to assess if mediation is appropriate\n2. Joint sessions to identify issues and priorities\n3. Private caucuses where the mediator meets with each party separately\n4. Drafting of settlement agreements\n\nWhile mediation works for many couples, it may not be suitable in cases involving domestic violence or significant power imbalances."
    },
    {
        "title": "Commercial Lease Negotiation: Key Provisions to Consider",
        "date": "2023-09-12",
        "content": "Negotiating a commercial lease can significantly impact your business's bottom line and operational flexibility. Here are critical provisions to scrutinize:\n\n1. Rent Structure:\n- Base rent vs. percentage rent\n- CAM (Common Area Maintenance) charges\n- Rent escalations and how they're calculated\n\n2. Lease Term:\n- Initial term length\n- Renewal options and conditions\n- Early termination clauses\n\n3. Use Clause:\n- Specificity about permitted uses\n- Exclusive use provisions (for retail)\n- Restrictions on alterations\n\n4. Assignment and Subletting:\n- Landlord approval requirements\n- Conditions under which consent can't be unreasonably withheld\n\n5. Maintenance and Repairs:\n- Clear delineation of responsibilities\n- Capital improvement obligations\n\nAlways have an experienced real estate attorney review any commercial lease before signing. What appears to be standard language often contains pitfalls that could cost your business significantly."
    }
]
